Repository: arduino/Arduino
Catalog: arduino-core/src/processing/app/i18n/Resources_*.po
Languages: bg

source: (requires restart of Arduino)
bg: (изисква рестартиране на Ардуино)

source: Not used: {0}
bg: Неизползвани: {0}

source: Used: {0}
bg: Използвани: {0}

source: 'Keyboard' not found. Does your sketch include the line '#include <Keyboard.h>'?
bg: 'Keyboard' не е намерена. Съдържа ли се в скицата Ви редът '#include <Keyboard.h>'?

source: 'Mouse' not found. Does your sketch include the line '#include <Mouse.h>'?
bg: 'Mouse' не е намерена. Съдържа ли се в скицата Ви редът '#include <Mouse.h>'?

source: 'arch' folder is no longer supported! See http://goo.gl/gfFJzU for more information
bg: Папката 'arch' вече не се поддържа! За повече информация вижте http://goo.gl/gfFJzU

source: (edit only when Arduino is not running)
bg: (редактирайте само при нестартирано Ардуино)

source: (legacy)
bg: (остаряло)

source: --curdir no longer supported
bg: --curdir не се поддържа вече

source: --verbose, --verbose-upload and --verbose-build can only be used together with --verify or --upload
bg: --verbose, --verbose-upload и --verbose-build може да се използват само заедно с --verify или --upload

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Do you want to save changes to this sketch<BR> before closing?</b><p>If you don't save, your changes will be lost.
bg: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Искате ли да запишете промените в тази скица<BR> преди да я затворите?</b><p>Ако не я запишете, промените ще бъдат изгубени.

source: A file named "{0}" already exists in "{1}"
bg: Файл с име "{0}" вече съществува в "{1}"

source: A folder named "{0}" already exists. Can't open sketch.
bg: Папка с име "{0}" вече съществува. Не мога да отворя скица.

source: A library named {0} already exists
bg: Библиотека с име {0} вече съществува

source: A new version of Arduino is available, would you like to visit the Arduino download page?
bg: Налична е нова версия на Ардуино, искате ли да погледнете страницата за сваляне на Ардуино?

source: A newer {0} package is available
bg: Наличен е нов {0} пакет

source: A subfolder of your sketchbook is not a valid library
bg: Подпапката на скицника не е валидна библиотека

source: About Arduino
bg: Относно Ардуино

source: Add .ZIP Library...
bg: Добавяне на .ZIP библиотека...

source: Add File...
bg: Добавяне на файл...

source: Additional Boards Manager URLs
bg: URL-и към допълнителни мениджъри на платки

source: Additional Boards Manager URLs:
bg: URL-и към допълнителни мениджъри на платки:

source: Albanian
bg: Албански

source: All
bg: Всички

source: An error occurred while trying to fix the file encoding. Do not attempt to save this sketch as it may overwrite the old version. Use Open to re-open the sketch and try again.
bg: Възникна грешка при опита за корекция кодирането на файла. Не се опитвайте да запишете тази скица тъй като може да препокриете старата версия. Използвайте Отвори за да отворите скицата и опитайте отново.

source: An error occurred while updating libraries index!
bg: Възникна грешка при обновяване индекса на библиотеките!

source: An error occurred while uploading the sketch
bg: Възникна грешка при качването на скицата

source: An error occurred while verifying the sketch
bg: Възникна грешка при проверката на скицата

source: An error occurred while verifying/uploading the sketch
bg: Възникна грешка при проверката/качването на скицата

source: An unknown error occurred while trying to load platform-specific code for your machine.
bg: Възникна непозната грешка при опит да се зареди специфичен за платформата код на машината Ви.

source: Arabic
bg: Арабски

source: Aragonese
bg: Арагонски

source: Archive Sketch
bg: Архивирай скицата

source: Archive sketch as:
bg: Архивиране скицата като:

source: Archive sketch canceled.
bg: Архивирането на скицата е прекратено.

source: Archiving the sketch has been canceled because the sketch couldn't save properly.
bg: Архивирането на скицата беше прекратено понеже скицата не можа да бъде записана правилно.

source: Arduino
bg: Ардуино

source: Arduino ARM (32-bits) Boards
bg: Arduino ARM (32-битови) платки

source: Arduino AVR Boards
bg: Arduino AVR платки

source: Arduino can only open its own sketches and other files ending in .ino or .pde
bg: Arduino може да отваря само негови скици и други файлове с разширение .ino или .pde

source: Arduino cannot run because it could not create a folder to store your settings.
bg: Ардуино не може да тръгне, понеже не може да създаде папка за съхранение на Вашите настройки.

source: Arduino cannot run because it could not create a folder to store your sketchbook.
bg: Ардуино не може да тръгне, понеже не може да създаде папка за съхранение на Вашия скицник.

source: Arduino:
bg: Ардуино:

source: Are you sure you want to delete "{0}"?
bg: Сигурни ли сте, че искате да изтриете "{0}"?

source: Are you sure you want to delete this sketch?
bg: Сигурни ли сте, че искате да изтриете скицата?

source: Argument required for --board
bg: След --board се изисква аргумент

source: Argument required for --port
bg: След --port се изисква аргумент

source: Argument required for --pref
bg: След --pref се изисква аргумент

source: Argument required for --preferences-file
bg: След --preferences-file се изисква аргумент

source: Argument required for {0}
bg: Изисква се аргумент за {0}

source: Armenian
bg: Арменски

source: Asturian
bg: Астурийски

source: Authorization required
bg: Изисква се удостоверяване

source: Auto Format
bg: Автоформатиране

source: Auto Format finished.
bg: Автоформатирането завърши.

source: Auto-detect proxy settings
bg: Автоматично откриване на proxy настройките

source: Automatic proxy configuration URL:
bg: URL за автоматично настройване на proxy:

source: Autoscroll
bg: Автоскрол

source: Bad error line: {0}
bg: Недопустима грешка на ред: {0}

source: Bad file selected
bg: Избран е грешен файл

source: Basque
bg: Баски

source: Belarusian
bg: Беларуски

source: Board
bg: Платка

source: Board {0} (platform {1}, package {2}) is unknown
bg: Платката {0} (платформа {1}, пакет {2}) е непозната

source: Board {0}:{1}:{2} doesn''t define a ''build.board'' preference. Auto-set to: {3}
bg: Платката {0}:{1}:{2} не определя ''build.board'' характеристика. Автоматично зададено: {3}

source: Board:
bg: Платка:

source: Boards Manager
bg: Мениджър на платки

source: Boards Manager...
bg: Мениджър на платки...

source: Boards included in this package:
bg: Платки, включени в този пакет:

source: Bootloader file specified but missing: {0}
bg: Зададен, но липсващ файл за начално зареждане: {0}

source: Bosnian
bg: Босненски

source: Both NL & CR
bg: Завършващи символи NL и CR

source: Browse
bg: Разглеждане

source: Build options changed, rebuilding all
bg: Има променени опции за изграждане. Правя всичко наново

source: Built-in Examples
bg: Вградени примери

source: Bulgarian
bg: Български

source: Burmese (Myanmar)
bg: Бирмански (Мианмар)

source: Burn Bootloader
bg: Запиши буутлоудър

source: Burning bootloader to I/O Board (this may take a minute)...
bg: Записвам буутлоудъра на I/O платка (може да продължи минута)...

source: CRC doesn't match. File is corrupted.
bg: CRC не съвпада. Файлът е повреден.

source: Can only pass one of: {0}
bg: Може да премине само един от: {0}

source: Can't find the sketch in the specified path
bg: Не намирам скица в посочения път

source: Canadian French
bg: Канадски френски

source: Cancel
bg: Отказ

source: Cannot Rename
bg: Не може да се преименува

source: Cannot specify any sketch files
bg: Не може да се зададе никакъв файл-скица

source: Carriage return
bg: Завършващ символ CR

source: Catalan
bg: Каталонски

source: Check for updates on startup
bg: Проверявай за обновления при стартиране

source: Chinese (China)
bg: Китайски (Китай)

source: Chinese (Taiwan)
bg: Китайски (Тайван)

source: Chinese (Taiwan) (Big5)
bg: Китайски (Тайван) (Big5)

source: Click for a list of unofficial boards support URLs
bg: Цъкнете за списък URL-и към неофициално поддържани платки

source: Close
bg: Затвори

source: Comment/Uncomment
bg: Коментирай/Откоментирай

source: Communication
bg: Комуникация

source: Compiler warnings:
bg: Предупреждения на компилатора:

source: Compiling sketch...
bg: Компилиране на скицата...

source: Contributed
bg: Публикувано

source: Copy
bg: Копиране

source: Copy as HTML
bg: Копиране като HTML

source: Copy error messages
bg: Съобщения за грешки при копиране

source: Copy for Forum
bg: Копиране за форума

source: Could not add ''{0}'' to the sketch.
bg: Не можах да добавя ''{0}'' към скицата.

source: Could not copy to a proper location.
bg: Не можах да копирам на подходящото място.

source: Could not create the sketch folder.
bg: Не можах да създам папка за скицата.

source: Could not create the sketch.
bg: Не можах да създам скицата.

source: Could not delete "{0}".
bg: Не можах да изтрия "{0}".

source: Could not delete the existing ''{0}'' file.
bg: Не можах да изтрия съществуващия ''{0}'' файл.

source: Could not delete {0}
bg: Не мога да изтрия {0}

source: Could not find boards.txt in {0}. Is it pre-1.5?
bg: Не можах да намеря boards.txt в {0}. Това да не е pre-1.5?

source: Could not find tool {0}
bg: Не можах да намеря инструмента {0}

source: Could not find tool {0} from package {1}
bg: Не можах да намеря инструмента {0} от пакета {1}

source: Could not open the URL {0}
bg: Не мога да отворя URL-а {0}

source: Could not open the folder {0}
bg: Не мога да отворя папката {0}

source: Could not properly re-save the sketch. You may be in trouble at this point, and it might be time to copy and paste your code to another text editor.
bg: Не можах да презапиша скицата. Може да имаме неприятности с това, помислете дали да не копирате и поставите кода в друг текстов редактор.

source: Could not re-save sketch
bg: Не можах да презапиша скицата

source: Could not read color theme settings. You'll need to reinstall Arduino.
bg: Не можах да прочета цветовите настройки на темата. Ще трябва да преинсталирате Arduino.

source: Could not read default settings. You'll need to reinstall Arduino.
bg: Не мога да прочета настройките по подразбиране. Ще трябва да преинсталирате Ардуино.

source: Could not remove old version of {0}
bg: Не мога да премахна стара версия на {0}

source: Could not rename "{0}" to "{1}"
bg: Не можах да преименувам "{0}" на "{1}"

source: Could not rename the sketch. (0)
bg: Не можах да преименувам скицата. (0)

source: Could not rename the sketch. (1)
bg: Не можах да преименувам скицата. (1)

source: Could not rename the sketch. (2)
bg: Не можах да преименувам скицата. (2)

source: Could not replace {0}
bg: Не мога да заменя {0}

source: Couldn't archive sketch
bg: Не можах да архивирам скицата

source: Couldn't determine program size: {0}
bg: Не можах да определя големината на програмата: {0}

source: Couldn't do it
bg: Не можах да го направя

source: Couldn't find a Board on the selected port. Check that you have the correct port selected. If it is correct, try pressing the board's reset button after initiating the upload.
bg: Не намерих платка на избрания порт. Провете дали сте избрали правилния порт. Ако е правилният, пробвайте като натиснете бутона reset на платката, след като инициирате качването.

source: Croatian
bg: Хърватски

source: Cut
bg: Изрязване

source: Data Processing
bg: Обработка на данни

source: Data Storage
bg: Хранилище за данни

source: Decrease Indent
bg: Намали отстъпа

source: Default
bg: Подразбиращ се

source: Delete
bg: Изтрий

source: Device Control
bg: Контрол на устройство

source: Device is not responding, check the right serial port is selected or RESET the board right before exporting
bg: Устройството не отговаря, проверете дали сте избрали правилния сериен порт или направете RESET на платката преди експортирането

source: Discard all changes and reload sketch?
bg: Отхвърли всички промени и презареди скицата?

source: Display
bg: Дисплей

source: Display line numbers
bg: Покажи номерата на редовете

source: Do you want to remove {0}? If you do so you won't be able to use {0} any more.
bg: Искате да премахнете {0}? Ако го направите, повече няма да може да ползвате {0}.

source: Don't Save
bg: Не записвай

source: Done Saving.
bg: Записването завърши.

source: Done burning bootloader.
bg: Записът на буутлоудъра завърши.

source: Done compiling
bg: Компилирането завърши

source: Done compiling.
bg: Компилирането завърши.

source: Done printing.
bg: Отпечатването завърши.

source: Done uploading
bg: Качването завърши

source: Done uploading.
bg: Качването завърши.

source: Downloaded {0}kb of {1}kb.
bg: Свалени {0}kb от {1}kb.

source: Downloading boards definitions.
bg: Сваляне дефиниции на платки.

source: Downloading libraries index...
bg: Сваляне на списък библиотеки...

source: Downloading library: {0}
bg: Сваляне на библиотека: {0}

source: Downloading platforms index...
bg: Сваляне на списък платформи...

source: Downloading tools ({0}/{1}).
bg: Сваляне на инструменти ({0}/{1}).

source: Dutch
bg: Холандски

source: Dutch (Netherlands)
bg: Холандски (Холандия)

source: Edison Help
bg: Edison помощ

source: Edit
bg: Редактиране

source: Editor font size:
bg: Размер на шрифта в редактора:

source: Editor language:
bg: Език на редактора:

source: Enable Code Folding
bg: Разреши скриване на кода (Code Folding)

source: English
bg: Английски

source: English (United Kingdom)
bg: Английски (Великобритания)

source: Enter a comma separated list of urls
bg: Въведете списък url-и разделени със запетая

source: Enter additional URLs, one for each row
bg: Въведете допълнителни URL-и, по един на ред

source: Environment
bg: Среда

source: Error
bg: Грешка

source: Error adding file
bg: Грешка при добавянето на файл

source: Error compiling.
bg: Грешка при компилирането.

source: Error downloading {0}
bg: Грешка при сваляне на {0}

source: Error getting the Arduino data folder.
bg: Грешка при получаване папката за данни на Ардуино

source: Error inside Serial.{0}()
bg: Грешка в Serial.{0}()

source: Error loading {0}
bg: Грешка при зареждане на {0}

source: Error opening serial port ''{0}''.
bg: Грешка при отварянето на сериен порт ''{0}''.

source: Error opening serial port ''{0}''. Try consulting the documentation at http://playground.arduino.cc/Linux/All#Permission
bg: Грешка при отваряне на сериен порт ''{0}''. Консултирайте се с документацията на http://playground.arduino.cc/Linux/All#Permission

source: Error reading preferences
bg: Грешка при четене на предпочитанията

source: Error reading the preferences file. Please delete (or move) {0} and restart Arduino.
bg: Грешка при четене на файла с предпочитания. Моля изтрийте (или преместете) {0} и рестартирайте Ардуино.

source: Error running post install script
bg: Грешка при изпълнението на завършващия инсталирането скрипт

source: Error starting discovery method:
bg: Грешка при стартиране метод за откриване:

source: Error touching serial port ''{0}''.
bg: Грешка при пробването на сериен порт ''{0}''.

source: Error while burning bootloader.
bg: Грешка при записа на буутлоудъра.

source: Error while burning bootloader: missing '{0}' configuration parameter
bg: Грешка при запис на буутлоудъра: липсващ '{0}' конфигурационен параметър

source: Error while compiling: missing '{0}' configuration parameter
bg: Грешка при компилиране: липсващ '{0}' конфигурационен параметър

source: Error while loading code {0}
bg: Грешка при зареждане на код {0}

source: Error while printing.
bg: Грешка при отпечатването.

source: Error while setting serial port parameters: {0} {1} {2} {3}
bg: Грешка при задаване параметрите на серийния порт: {0} {1} {2} {3}

source: Error while uploading
bg: Грешка при качването

source: Error while uploading: missing '{0}' configuration parameter
bg: Грешка при качване: липсващ '{0}' конфигурационен параметър

source: Error while verifying
bg: Грешка при проверката

source: Error while verifying/uploading
bg: Грешка при проверката/качването

source: Estonian
bg: Естонски

source: Estonian (Estonia)
bg: Естонски (Естония)

source: Examples
bg: Примери

source: Examples from Custom Libraries
bg: Примери от потребителски библиотеки

source: Examples from Libraries
bg: Примери от библиотеки

source: Export canceled, changes must first be saved.
bg: Експортирането прекратено, промените първо трябва да бъдат записани.

source: Export compiled Binary
bg: Експорт на компилирано binary

source: Failed to open sketch: "{0}"
bg: Провали се отварянето на скица: "{0}"

source: File
bg: Файл

source: Filipino
bg: Филипински

source: Filter your search...
bg: Филтрира търсенето ...

source: Find
bg: Търси

source: Find Next
bg: Търси следващото

source: Find Previous
bg: Търси предишното

source: Find in Reference
bg: Потърси в справочника

source: Find...
bg: Търсене...

source: Find:
bg: Търси:

source: Finnish
bg: Фински

source: Fix Encoding & Reload
bg: Оправи кодирането & Презареди

source: For information on installing libraries, see: http://www.arduino.cc/en/Guide/Libraries
bg: За информация относно инсталирането на библиотеки, вижте: http://www.arduino.cc/en/Guide/Libraries

source: Forcing reset using 1200bps open/close on port {0}
bg: Принудителен ресет с 1200bps отваряне/затваряне на порт {0}

source: French
bg: Френски

source: Frequently Asked Questions
bg: Често Задавани Въпроси

source: Galician
bg: Галицийски

source: Galileo Help
bg: Galileo помощ

source: Georgian
bg: Грузински

source: German
bg: Немски

source: Getting Started
bg: Първи стъпки

source: Global variables use {0} bytes ({2}%%) of dynamic memory, leaving {3} bytes for local variables. Maximum is {1} bytes.
bg: Глобалните променливи ползват {0} байта ({2}%%) от динамичната памет, оставяйки {3} байта за локални променливи. Максимумът е {1} байта.

source: Global variables use {0} bytes of dynamic memory.
bg: Глобалните променливи ползват {0} байта от динамичната памет.

source: Go to line
bg: Отиди на ред

source: Go to line...
bg: Отиди на ред ...

source: Greek
bg: Гръцки

source: Hebrew
bg: Иврит

source: Help
bg: Помощ

source: Hindi
bg: Хинди

source: Host name:
bg: Име на хост:

source: How about saving the sketch first before trying to rename it?
bg: Какво ще кажете, да запишем първо скицата и после да я преименуваме?

source: How very Borges of you
bg: Ей-й, ти голям писател се извъди!

source: Hungarian
bg: Унгарски

source: Ignore Case
bg: Игнорирай малки/ГОЛЕМИ

source: Ignoring bad library name
bg: Игнориране на библиотека с неподходящо име

source: Ignoring sketch with bad name
bg: Игнориране на скица с неподходящо име

source: In Arduino 1.0, the default file extension has changed from .pde to .ino. New sketches (including those created by "Save-As") will use the new extension. The extension of existing sketches will be updated on save, but you can disable this in the Preferences dialog. Save sketch and update its extension?
bg: В Ардуйно 1.0, разширението по подразбиране беше сменено от .pde на .ino. Новите скици (включително създадените чрез "Запиши като") ще са с новото разширение. Разширението на съществуващите скици ще се обновява при запис, но Вие можете да забраните това в диалога Предпочитания. Запис на скицата и обновяване на разширението и?

source: Include Library
bg: Включи библиотека

source: Incorrect IDE installation folder
bg: Некоректна IDE инсталационна папка

source: Increase Indent
bg: Увеличи отстъпа

source: Indonesian
bg: Индонезийски

source: Initializing packages...
bg: Инициализиране на пакети...

source: Install
bg: Инсталиране

source: Installation completed!
bg: Инсталирането завърши!

source: Installed
bg: Инсталирано

source: Installing boards...
bg: Инсталиране на платки...

source: Installing library: {0}
bg: Инсталиране на библиотека: {0}

source: Installing tools ({0}/{1})...
bg: Инсталиране на инструменти ({0}/{1})...

source: Installing...
bg: Инсталиране...

source: Invalid library found in {0}: {1}
bg: Намерена невалидна библиотека в {0}: {1}

source: Invalid quoting: no closing [{0}] char found.
bg: Невалиден текст: липсва затварящ [{0}] знак.

source: Italian
bg: Италиански

source: Japanese
bg: Японски

source: Korean
bg: Корейски

source: Latvian
bg: Латвийски

source: Library Manager
bg: Мениджър библиотеки

source: Library added to your libraries. Check "Include library" menu
bg: Библиотеката е добавена към Вашите библиотеки. Вижте менюто "Включване на библиотека"

source: Library can't use both 'src' and 'utility' folders. Double check {0}
bg: Библиотеката не може да ползва едновременно папките 'src' и 'utility'. Проверете отново {0}

source: Library is already installed: {0} version {1}
bg: Библиотеката е вече инсталирана: {0} версия {1}

source: Line number:
bg: Ред номер:

source: Lithuaninan
bg: Литовски

source: Loading configuration...
bg: Зареждане на конфигурацията...

source: Looking for recipes like {0}*{1}
bg: Търсене на рецепти като {0}*{1}

source: Low memory available, stability problems may occur.
bg: Достъпната памет е малко. Възможни са проблеми.

source: Manage Libraries...
bg: Управление на библиотеки ...

source: Manual proxy configuration
bg: Ръчно конфигуриране на прокси

source: Marathi
bg: Маратхи

source: Message
bg: Съобщение

source: Missing '{0}' from library in {1}
bg: Липсващ '{0}' от библиотека в {1}

source: Mode not supported
bg: Режимът не се поддържа

source: More
bg: Още

source: More preferences can be edited directly in the file
bg: Повече предпочитания може да редактирате директно във файла

source: Moving
bg: Преместване

source: Multiple files not supported
bg: Множество файлове не се поддържат

source: Multiple libraries were found for "{0}"
bg: Намерени са няколко библиотеки за "{0}"

source: Must specify exactly one sketch file
bg: Трябва да укажете точно един файл-скица

source: Name for new file:
bg: Име за нов файл:

source: Nepali
bg: Непалски

source: Network
bg: Мрежа

source: Network ports
bg: Мрежови портове

source: Network upload using programmer not supported
bg: Качване по мрежата чрез програматор не се поддържа

source: New
bg: Нова

source: New Tab
bg: Нов подпрозорец

source: Newline
bg: Завършващ символ NL

source: Next Tab
bg: Следващ подпрозорец

source: No
bg: Не

source: No authorization data found
bg: Не са намерени данни за удостоверяване

source: No changes necessary for Auto Format.
bg: Не са необходими промени за автоформатирането.

source: No command line parameters found
bg: Не са намерени параметри в командния ред

source: No compiled sketch found
bg: Не е намерена компилирана скица

source: No files were added to the sketch.
bg: Не бяха добавени файлове към скицата.

source: No launcher available
bg: Няма зададен браузър

source: No line ending
bg: Без завършващи символи

source: No parameters
bg: Няма параметри

source: No proxy
bg: Без прокси

source: No really, time for some fresh air for you.
bg: Не, наистина, за теб е време за малко свеж въздух.

source: No reference available for "{0}"
bg: Не е налично описание за "{0}"

source: No sketch
bg: Няма скица

source: No sketchbook
bg: Няма скицник

source: No valid code files found
bg: Няма намерени валидни файлове с код

source: No valid hardware definitions found in folder {0}.
bg: Няма намерени валидни дефиниции за хардуер в папка {0}.

source: None
bg: Няма

source: Norwegian Bokmål
bg: Норвежки Bokmål

source: Not enough memory; see http://www.arduino.cc/en/Guide/Troubleshooting#size for tips on reducing your footprint.
bg: Няма достатъчно памет; вижте http://www.arduino.cc/en/Guide/Troubleshooting#size за съвети как да намалите обема на това, което правите.

source: One file added to the sketch.
bg: Един файл е добавен към скицата.
