Repository: arduino/Arduino
Catalog: arduino-core/src/processing/app/i18n/Resources_*.po
Languages: bg

source: Only --verify, --upload or --get-pref are supported
bg: Поддържат се само --verify, --upload или --get-pref

source: Open
bg: Отваряне

source: Open Recent
bg: Отвори скорошен

source: Open URL
bg: Отвори URL

source: Open an Arduino sketch...
bg: Отваряне на Ардуино скица...

source: Open...
bg: Отваряне...

source: Other
bg: Друг

source: Page Setup
bg: Настройка на страницата

source: Partner
bg: Партньор

source: Password:
bg: Парола:

source: Paste
bg: Поставяне

source: Persian
bg: Персийски

source: Persian (Iran)
bg: Персийски (Иран)

source: Platform {0} (package {1}) is unknown
bg: Платформа {0} (пакет {1}) е непознат

source: Please confirm boards deletion
bg: Моля, потвърдете изтриването на платката

source: Please confirm library deletion
bg: Моля, потвърдете изтриването на библиотеката

source: Please import the SPI library from the Sketch > Import Library menu.
bg: Моля, импортирайте библиотеката SPI от менюто Скица > Импортиране на библиотека.

source: Please import the Wire library from the Sketch > Import Library menu.
bg: Моля, импортирайте библиотеката Wire от менюто Скица > Импортиране на библиотека.

source: Please select a programmer from Tools->Programmer menu
bg: Моля, изберете програматор от менюто Инструменти->Програматор

source: Polish
bg: Полски

source: Port
bg: Порт

source: Port number:
bg: Номер на порт:

source: Portugese
bg: Португалски

source: Portuguese (Brazil)
bg: Португалски (Бразилия)

source: Portuguese (Portugal)
bg: Португалски (Португалия)

source: Preferences
bg: Предпочитания

source: Preparing boards...
bg: Подготовка на платки...

source: Previous
bg: Предишно

source: Previous Tab
bg: Предишен подпрозорец

source: Print
bg: Отпечатване

source: Printing canceled.
bg: Отпечатването прекратено.

source: Printing...
bg: Отпечатване...

source: Problem Opening Folder
bg: Проблем при отваряне на папка

source: Problem Opening URL
bg: Проблем при отваряне на URL

source: Problem Setting the Platform
bg: Проблем при установяването на платформата.

source: Problem accessing board folder /www/sd
bg: Проблем при достъп до папка /www/sd на платката

source: Problem accessing files in folder "{0}"
bg: Проблем при достъп до файлове в папка "{0}"

source: Problem getting data folder
bg: Проблем при получаване папката за данни

source: Problem uploading to board. See http://www.arduino.cc/en/Guide/Troubleshooting#upload for suggestions.
bg: Проблем при качването към платката. Вижте http://www.arduino.cc/en/Guide/Troubleshooting#upload за съвети.

source: Problem with rename
bg: Проблем с преименуването

source: Processor
bg: Процесор

source: Programmer
bg: Програматор

source: Progress {0}
bg: Напредък {0}

source: Quit
bg: Изход

source: RETIRED
bg: ИЗТЕГЛЕНО ОТ УПОТРЕБА

source: Recommended
bg: Препоръчано

source: Redo
bg: Повторение

source: Reference
bg: Справочник

source: Remove
bg: Премахва

source: Removing library: {0}
bg: Премахва библиотека: {0}

source: Removing...
bg: Премахване ...

source: Rename
bg: Преименуване

source: Replace
bg: Замяна

source: Replace & Find
bg: Замяна и търсене

source: Replace All
bg: Замени всички

source: Replace the existing version of {0}?
bg: Да заменя ли съществуващата версия на {0}?

source: Replace with:
bg: Замени с:

source: Retired
bg: Изтеглено от употреба

source: Romanian
bg: Румънски

source: Running: {0}
bg: Изпълнение: {0}

source: Russian
bg: Руски

source: Save
bg: Записване

source: Save As...
bg: Запис като...

source: Save Canceled.
bg: Записването прекратено.

source: Save changes to "{0}"?
bg: Да запиша ли промените в "{0}"?

source: Save sketch folder as...
bg: Запиши папката на скицата като...

source: Save when verifying or uploading
bg: Запис при проверката или качването

source: Saving...
bg: Записване...

source: Search all Sketch Tabs
bg: Търсене във всички подпрозорци

source: Select (or create new) folder for sketches...
bg: Избор на папка (или създаване на нова) за скици...

source: Select All
bg: Маркирай всичко

source: Select a zip file or a folder containing the library you'd like to add
bg: Изберете zip файл или папка, съдържащи библиотеката, която искате да добавите

source: Select an image or other data file to copy to your sketch
bg: Изберете изображение или друг файл с данни за копиране към Вашата скица

source: Select new sketchbook location
bg: Изберете ново местоположение на скицник

source: Select version
bg: Избор версия

source: Selected board depends on '{0}' core (not installed).
bg: Избраната платка изисква '{0}' ядро (не е инсталирано).

source: Selected board is not available
bg: Избраната платка не е налична

source: Selected library is not available
bg: Избраната библиотека не е налична

source: Send
bg: Изпрати

source: Sensors
bg: Сензори

source: Serial Monitor
bg: Сериен монитор

source: Serial Plotter
bg: Сериен плотер

source: Serial port ''{0}'' not found. Did you select the right one from the Tools > Serial Port menu?
bg: Серийният порт ''{0}'' не е намерен. Дали сте избрали правилния от менюто Инструменти > Сериен порт?

source: Serial port {0} not found. Retry the upload with another serial port?
bg: Серийният порт {0} не е намерен. Пробвайте качване чрез друг сериен порт?

source: Serial ports
bg: Серийни портове

source: Settings
bg: Настройки

source: Settings issues
bg: Въпроси, свързани с настройките

source: Show Sketch Folder
bg: Покажи папката на скицата

source: Show verbose output during:
bg: Показвай подробна информация при:

source: Signal Input/Output
bg: Сигнал Вход/Изход

source: Sketch
bg: Скица

source: Sketch Disappeared
bg: Скицата изчезна

source: Sketch Does Not Exist
bg: Скицата не съществува

source: Sketch is Read-Only
bg: Скицата е само за четене

source: Sketch is Untitled
bg: Скицата е без име

source: Sketch is read-only
bg: Скицата е само за четене

source: Sketch too big; see http://www.arduino.cc/en/Guide/Troubleshooting#size for tips on reducing it.
bg: Скицата е твърде голяма; вижте http://www.arduino.cc/en/Guide/Troubleshooting#size за съвети как да я намалите.

source: Sketch uses {0} bytes ({2}%%) of program storage space. Maximum is {1} bytes.
bg: Скицата използва {0} байта ({2}%%) от пространството за програми. Максимумът е {1} байта.

source: Sketchbook
bg: Скицник

source: Sketchbook folder disappeared
bg: Папката със скици изчезна

source: Sketchbook location:
bg: Местоположение на скицника:

source: Sketchbook path not defined
bg: Не е зададен път до скицника

source: Slovenian
bg: Словенски

source: Some files are marked "read-only", so you'll need to re-save the sketch in another location, and try again.
bg: Някои файлове са с флаг "само за четене", така че ще трябва да запишете скицата на друго място, и да опитате отново.

source: Some files are marked "read-only", so you'll need to re-save this sketch to another location.
bg: Някои файлове са с флаг "само за четене", така че ще трябва да презапишете тази скица на друго място.

source: Sorry, a sketch (or folder) named "{0}" already exists.
bg: Съжалявам, скица (или папка) с име "{0}" вече съществува.

source: Spanish
bg: Испански

source: Starting...
bg: Стартиране ...

source: Sunshine
bg: Слънчева светлина

source: Swedish
bg: Шведски

source: System Default
bg: Подразбиращ се за системата

source: Tamil
bg: Тамилски

source: The 'BYTE' keyword is no longer supported.
bg: Ключовата дума 'BYTE' вече не се поддържа.

source: The --upload option supports only one file at a time
bg: Опцията --upload се използва само с един файл

source: The Client class has been renamed EthernetClient.
bg: Класът Client беше преименуван на EthernetClient.

source: The Server class has been renamed EthernetServer.
bg: Класът Server беше преименуван на EthernetServer.

source: The Udp class has been renamed EthernetUdp.
bg: Класът Udp беше преименуван на EthernetUdp.

source: The file "{0}" needs to be inside a sketch folder named "{1}". Create this folder, move the file, and continue?
bg: Файлът "{0}" трябва да е в папката с име "{1}" на скицата. Да създам ли папката, да преместя файла и да продължа?

source: The library "{0}" cannot be used. Library names must contain only basic letters and numbers. (ASCII only and no spaces, and it cannot start with a number)
bg: Библиотеката "{0}" не може да се ползва. Имената на библиотеки трябва да са съставени само от основни букви и числа. (Само ASCII, без интервали и не може да започват с цифра)

source: The main file can't use an extension. (It may be time for your to graduate to a "real" programming environment)
bg: Главният файл не може да ползва разширение. (Може би е време да преминете към "истинска" среда за програмиране)

source: The name cannot start with a period.
bg: Името не може да започва с точка.

source: The selected sketch no longer exists. You may need to restart Arduino to update the sketchbook menu.
bg: Избраната скица вече не съществува. Може да се наложи да рестартирате Ардуино, за да се обнови менюто на скицника.

source: The sketch "{0}" cannot be used. Sketch names must contain only basic letters and numbers (ASCII-only with no spaces, and it cannot start with a number). To get rid of this message, remove the sketch from {1}
bg: Скицата "{0}" не може да се ползва. Имената на скици трябва да са съставени само от основни букви и числа (Само ASCII, без интервали и не може да започват с цифра). За да не се появява това съобщение, премахнете скицата от {1}

source: The sketch folder has disappeared. Will attempt to re-save in the same location, but anything besides the code will be lost.
bg: Папката със скицата изчезна. Ще пробвам да я презапиша на същото място, но всичко, освен кода, ще бъде изгубено.

source: The sketch name had to be modified. Sketch names can only consist of ASCII characters and numbers (but cannot start with a number). They should also be less than 64 characters long.
bg: Името на скицата трябваше да бъде променено. Имената на скици може да съдържат само ASCII символи (но не може да започват с цифра). Те трябва също да са по-къси от 64 символа.

source: The sketchbook folder no longer exists. Arduino will switch to the default sketchbook location, and create a new sketchbook folder if necessary. Arduino will then stop talking about himself in the third person.
bg: Папката със скици вече не съществува. Ардуино ще премине към използване на местоположението по подразбиране и ще създаде нова папка ако е необходимо. След това, Ардуино ще спре да говори за себе си в трето лице.

source: This file has already been copied to the location from which where you're trying to add it. I ain't not doin nuthin'.
bg: Този файл вече е копиран на място, от където ти се опитваш да го добавиш. Няма да правя нищо.

source: Time for a Break
bg: Време за почивка

source: Tools
bg: Инструменти

source: Troubleshooting
bg: Отстраняване на проблеми

source: Turkish
bg: Турски

source: Type
bg: Тип

source: Type board password to access its console
bg: Въведете парола за платката за достъп до конзола

source: Type board password to upload a new sketch
bg: Въведете парола за платката, за да качите нова скица

source: Ukrainian
bg: Украински

source: Unable to connect: is the sketch using the bridge?
bg: Не мога да се свържа: скицата използва ли бриджа?

source: Unable to connect: retrying
bg: Не мога да се свържа: опитвам отново

source: Unable to connect: wrong password?
bg: Не мога да се свържа: грешна парола?

source: Unable to find {0} in {1}
bg: Не мога да намеря {0} в {1}

source: Unable to open serial monitor
bg: Не мога да отворя сериен монитор

source: Unable to open serial plotter
bg: Не мога да отворя серийния плотер

source: Unable to reach Arduino.cc due to possible network issues.
bg: Не мога да достигна до Arduino.cc вероятно поради проблем в мрежата.

source: Uncategorized
bg: Некатегоризирано

source: Undo
bg: Отмяна

source: Unspecified platform, no launcher available. To enable opening URLs or folders, add a "launcher=/path/to/app" line to preferences.txt
bg: Неизвестна платформа, няма зададен браузър. За да отваряте уеб адреси или папки, добавете ред "launcher=/път/до/приложението" в preferences.txt

source: Updatable
bg: Обновяем

source: Update
bg: Обновление

source: Update sketch files to new extension on save (.pde -> .ino)
bg: При запис обновявай файловете-скици към новото разширение (.pde -> .ino)

source: Updates available for some of your {0}boards{1}
bg: Налично е обновление за някои Ваши {0}платки{1}

source: Updates available for some of your {0}boards{1} and {2}libraries{3}
bg: Налични са обновления за някои Ваши {0}платки{1} и {2}библиотеки{3}

source: Updates available for some of your {0}libraries{1}
bg: Налично е обновление за някои Ваши {0}библиотеки{1}

source: Updating list of installed libraries
bg: Списък с обновяване на инсталирани библитеки

source: Upload
bg: Качване

source: Upload Using Programmer
bg: Качване чрез програматор

source: Upload canceled.
bg: Качването прекратено.

source: Upload cancelled
bg: Качването прекратено

source: Uploading to I/O Board...
bg: Качване към I/O платка...

source: Uploading...
bg: Качване...

source: Use Selection For Find
bg: Търси маркираното

source: Use external editor
bg: Ползвай външен редактор

source: Username:
bg: Потребител:

source: Using library {0} in folder: {1} {2}
bg: Използвайки библиотека {0} в папка: {1} {2}

source: Using previously compiled file: {0}
bg: Използвайки предишния компилиран файл: {0}

source: Verify
bg: Провери

source: Verify code after upload
bg: Проверка на кода след качването

source: Verify/Compile
bg: Проверка/Компилиране

source: Verifying and uploading...
bg: Проверка и качване ...

source: Verifying archive integrity...
bg: Проверка целостта на архив ...

source: Verifying...
bg: Проверка ...

source: Version <b>{0}</b>
bg: Версия <b>{0}</b>

source: Version unknown
bg: Неизвестна версия

source: Version {0}
bg: Версия {0}

source: Vietnamese
bg: Виетнамски

source: Visit Arduino.cc
bg: Посетете Arduino.cc

source: WARNING: library {0} claims to run on {1} architecture(s) and may be incompatible with your current board which runs on {2} architecture(s).
bg: ВНИМАНИЕ: библиотеката {0} твърди, че работи на {1} архитектури и може да е несъвместима с текущата Ви платка, която е с {2} архитектура.

source: Warning
bg: Внимание

source: Wire.receive() has been renamed Wire.read().
bg: Wire.receive() беше преименувана на Wire.read().

source: Wire.send() has been renamed Wire.write().
bg: Wire.send() беше преименувана на Wire.write().

source: Wrap Around
bg: Част от дума

source: Wrong microcontroller found. Did you select the right board from the Tools > Board menu?
bg: Намерен е грешен микроконтролер. Дали от менюто Инструменти > Платка сте избрали правилната?

source: Yes
bg: Да

source: You can't fool me
bg: Ти не можеш да ме излъжеш

source: You can't have a .cpp file with the same name as the sketch.
bg: Не може да имате .cpp файл с име като на скицата.

source: You can't import a folder that contains your sketchbook
bg: Не може да импортирате папката, съдържаща скицата Ви

source: You can't rename the sketch to "{0}" because the sketch already has a .cpp file with that name.
bg: Не може да преименувате скицата на "{0}" понеже скицата вече има .cpp файл с това име.

source: You can't save the sketch as "{0}" because the sketch already has a file with that name.
bg: Не може да запишете скицата като "{0}" понеже тя вече съдържа файл с това име.

source: You cannot save the sketch into a folder inside itself. This would go on forever.
bg: Не може да запишете скицата в папка в самата нея. Това ще продължи вечно.

source: You forgot your sketchbook
bg: Забравили сте Вашия скицник

source: You've pressed {0} but nothing was sent. Should you select a line ending?
bg: Натиснали сте {0}, но не беше изпратено нищо. Трябва ли да изберете завършване на ред?

source: You've reached the limit for auto naming of new sketches for the day. How about going for a walk instead?
bg: Достигнали сте лимита за автоматично именуване на нови скици за деня. Какво ще кажете за една малка разходка?

source: ZIP files or folders
bg: ZIP файлове или папки

source: Zip doesn't contain a library
bg: Zip файлът не съдържа библиотека

source: ".{0}" is not a valid extension.
bg: ".{0}" е невалидно разширение.

source: As of Arduino 0019, the Ethernet library depends on the SPI library. You appear to be using it or another library that depends on the SPI library.
bg: След Ардуино 0019, библиотеката Ethernet е зависима от библиотеката SPI. Изглежда, че ползвате нея или друга библиотека, зависима от библиотеката SPI.

source: As of Arduino 1.0, the 'BYTE' keyword is no longer supported. Please use Serial.write() instead.
bg: След Ардуино 1.0, ключовата дума 'BYTE' вече не се поддържа. Моля, ползвайте Serial.write().

source: As of Arduino 1.0, the Client class in the Ethernet library has been renamed to EthernetClient.
bg: След Ардуино 1.0, класът Client в библиотеката Ethernet беше преименуван на EthernetClient.

source: As of Arduino 1.0, the Server class in the Ethernet library has been renamed to EthernetServer.
bg: След Ардуино 1.0, класът Server в библиотеката Ethernet беше преименуван на EthernetServer.

source: As of Arduino 1.0, the Udp class in the Ethernet library has been renamed to EthernetUdp.
bg: След Ардуино 1.0, класът Udp в библиотеката Ethernet беше преименуван на EthernetUdp.

source: As of Arduino 1.0, the Wire.receive() function was renamed to Wire.read() for consistency with other libraries.
bg: След Ардуино 1.0, функцията Wire.receive() беше преименувана на Wire.read() за съгласуваност с други библиотеки.

source: As of Arduino 1.0, the Wire.send() function was renamed to Wire.write() for consistency with other libraries.
bg: След Ардуино 1.0, функцията Wire.send() беше преименувана на Wire.write() за съгласуваност с други библиотеки.

source: compilation
bg: компилиране

source: connected!
bg: свързан!

source: createNewFile() returned false
bg: createNewFile() върна false

source: ignoring invalid font size {0}
bg: игнорирам невалидна големина на шрифт {0}

source: name is null
bg: name е null

source: serialMenu is null
bg: serialMenu е null

source: the selected serial port {0} does not exist or your board is not connected
bg: избраният сериен порт {0} не съществува или платката Ви не е свързана

source: unknown option: {0}
bg: непозната опция: {0}

source: upload
bg: качване

source: version <b>{0}</b>
bg: версия <b>{0}</b>

source: {0} file signature verification failed
bg: {0} проверката на сигнатурата на файла не успя

source: {0} file signature verification failed. File ignored.
bg: {0} проверката на сигнатурата на файла не успя. Файлът игнориран.

source: {0} files added to the sketch.
bg: {0} файла добавени към скицата.

source: {0} libraries
bg: {0} библиотеки

source: {0} must be a folder
bg: {0} трябва да е папка

source: {0} returned {1}
bg: {0} върна {1}

source: {0} | Arduino {1}
bg: {0} | Ардуино {1}

source: {0}: Invalid argument to --pref, should be of the form "pref=value"
bg: {0}: Невалиден аргумент към --pref, трябва да е във формат "pref=value"

source: {0}: Invalid board name, it should be of the form "package:arch:board" or "package:arch:board:options"
bg: {0}: невалидно име на платка, трябва да е във формат "package:arch:board" или "package:arch:board:options"

source: {0}: Invalid option for "{1}" option for board "{2}"
bg: {0}: невалидна опция за "{1}" опция за платка "{2}"

source: {0}: Invalid option for board "{1}"
bg: {0}: невалидна опция за платка "{1}"

source: {0}: Invalid option, should be of the form "name=value"
bg: {0}: Невалидна опция, трябва да е във формат "name=value"

source: {0}: Unknown architecture
bg: {0}: Непозната архитектура

source: {0}: Unknown board
bg: {0}: Непозната платка

source: {0}: Unknown package
bg: {0}: Непознат пакет
